convection/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


vertices
(
    (0 0 0) 	// vertex number 0
    (1 0 0) 	// vertex number 1
    (1 0.05 0) 	// vertex number 2
    (0 0.05 0) 	// vertex number 3
    (0 0 1) 	// vertex number 4
    (1 0 1) 	// vertex number 5
    (1 0.05 1) 	// vertex number 6
    (0 0.05 1) 	// vertex number 7

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 20 50) simpleGrading (1 1 1)

);

edges
(
	arc 0 4 (-0.207 0 0.5)
	arc 4 5 (0.5 0 1.207)
	arc 5 1 (1.207 0 0.5)
	arc 1 0  (0.5 0 -0.207)

	arc 3 7 (-0.207 0.05 0.5)
	arc 7 6 (0.5 0.05 1.207)
	arc 6 2 (1.207 0.05 0.5)
	arc 2 3  (0.5 0.05 -0.207)
);

boundary
(
    floor
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    ceiling
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }

);

mergePatchPairs
(
);

convertToMeters 0.1;

// ************************************************************************* //
