convection/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 280;

boundaryField
{
    floor
    {
        type            fixedValue;
        value           uniform 318.107215;
    }
    ceiling
    {
        type            fixedValue;
        value           uniform 280;
    }
    fixedWalls
    {
        type            zeroGradient;
    }
    frontAndBack
    {
	type		zeroGradient;
    }
}

// ************************************************************************* //























